{
  "translation": {
    "Sign in": "Entrar",
    "Sign up": "Resgistar",
    "Turn data into decisions": "Transforma dados em decisões",
    "Analyze the market like the pros — with Intri Stock by your side.": "Analisa o mercado como os profissionais — com a Intri Stock ao teu lado.",
    "Because good investing doesn't depend on luck, but on clear, objective, and accessible information — and that's exactly what Intri Stock offers you.": "Porque investir bem não depende de sorte, mas de informação clara, objetiva e acessível — e é exatamente isso que a Intri Stock te oferece.",
    "Email" : "Email",
    "Password" : "Palavra-passe",
    "Repete password" : "Repetir a palavra-passe",
    "Accept the terms" : "Aceitar os termos",
    "Check terms" : "Vizualizar termos",
    "Already have a account ? -" : "Ainda não tens conta ?",
    "Click here" : "Clique aqui",
    "Invalid email address": "Endereço de e-mail inválido",
    "Disposable emails are not allowed": "Endereços de e-mail descartáveis não são permitidos",
    "Email already exists": "O e-mail já existe",
    "Passwords do not match": "As palavras-passe não coincidem",
    "Password is too weak": "A palavra-passe é demasiado fraca",
    "Password cannot be similar to the email address": "A palavra-passe não pode ser semelhante ao endereço de e-mail",
    "All fields are required": "Todos os campos são obrigatórios",
    "One of us ?" : "Um de nós ?",
    "New here ?" : "Novo aqui ?",
    "Get started for free" : "Começa grátis",
    "View our plans" : "Vê os nossos planos",
    "Technical Analysis": "Análise Técnica",
    "Advanced technical indicators to identify trends and chart patterns with precision.": "Indicadores técnicos avançados para identificar tendências e padrões gráficos com precisão.",
    "Fundamental Analysis": "Análise Fundamentalista",
    "Assess the intrinsic value of companies through financial metrics and macroeconomic indicators.": "Avalia o valor intrínseco das empresas através de métricas financeiras e indicadores macroeconómicos.",
    "Sector Comparisons": "Comparações Setoriais",
    "Compare companies within the same sector to identify the best investment opportunities.": "Compara empresas dentro do mesmo setor para identificar as melhores oportunidades de investimento.",
    "Advanced Screener": "Filtro Avançado",
    "Filter stocks using multiple criteria and uncover hidden opportunities in the market.": "Filtra ações por múltiplos critérios e descobre oportunidades ocultas no mercado.",
    "Stock Comparator": "Comparador de Ações",
    "Compare stocks side by side to see which companies stand out in their sector or metrics.": "Compara ações lado a lado para ver quais empresas se destacam no seu setor ou em métricas específicas.",
    "Investor Academy": "Academia de Investidores",
    "Learn from basic to advanced strategies with videos, quizzes, and hands-on modules.": "Aprende desde o básico até estratégias avançadas com vídeos, quizzes e módulos práticos.",
    "Back to Dashboard" : "Voltar ao dashboard",
    "Set your own customized style" : "Cusumiza o teu estilo",
    "Settings" : "Defenições"
  }
}
