{
  "translation": {
    "Sign in": "Entrar",
    "Sign up": "Resgistar",
    "Turn data into decisions": "Transforma dados em decisões",
    "Analyze the market like the pros — with Intri Stock by your side.": "Analisa o mercado como os profissionais — com a Intri Stock ao teu lado.",
    "Because good investing doesn't depend on luck, but on clear, objective, and accessible information — and that's exactly what Intri Stock offers you.": "Porque investir bem não depende de sorte, mas de informação clara, objetiva e acessível — e é exatamente isso que a Intri Stock te oferece.",
    "Email" : "Email",
    "Password" : "Palavra-passe",
    "Repete password" : "Repetir a palavra-passe",
    "Accept the terms" : "Aceitar os termos",
    "Check terms" : "Vizualizar termos",
    "Already have a account ? -" : "Ainda não tens conta ?",
    "Click here" : "Clique aqui",
    "Invalid email address": "Endereço de e-mail inválido",
    "Disposable emails are not allowed": "Endereços de e-mail descartáveis não são permitidos",
    "Email already exists": "O e-mail já existe",
    "Passwords do not match": "As palavras-passe não coincidem",
    "Password is too weak": "A palavra-passe é demasiado fraca",
    "Password cannot be similar to the email address": "A palavra-passe não pode ser semelhante ao endereço de e-mail",
    "All fields are required": "Todos os campos são obrigatórios",
    "One of us ?" : "Um de nós ?",
    "New here ?" : "Novo aqui ?",
    "Get started for free" : "Começa grátis",
    "View our plans" : "Vê os nossos planos",
    "Technical Analysis": "Análise Técnica",
    "Advanced technical indicators to identify trends and chart patterns with precision.": "Indicadores técnicos avançados para identificar tendências e padrões gráficos com precisão.",
    "Fundamental Analysis": "Análise Fundamentalista",
    "Assess the intrinsic value of companies through financial metrics and macroeconomic indicators.": "Avalia o valor intrínseco das empresas através de métricas financeiras e indicadores macroeconómicos.",
    "Sector Comparisons": "Comparações Setoriais",
    "Compare companies within the same sector to identify the best investment opportunities.": "Compara empresas dentro do mesmo setor para identificar as melhores oportunidades de investimento.",
    "Advanced Screener": "Filtro Avançado",
    "Filter stocks using multiple criteria and uncover hidden opportunities in the market.": "Filtra ações por múltiplos critérios e descobre oportunidades ocultas no mercado.",
    "Stock Comparator": "Comparador de Ações",
    "Compare stocks side by side to see which companies stand out in their sector or metrics.": "Compara ações lado a lado para ver quais empresas se destacam no seu setor ou em métricas específicas.",
    "Investor Academy": "Academia de Investidores",
    "Learn from basic to advanced strategies with videos, quizzes, and hands-on modules.": "Aprende desde o básico até estratégias avançadas com vídeos, quizzes e módulos práticos.",
    "Back to Dashboard" : "Voltar ao dashboard",
    "Set your own customized style" : "Cusumiza o teu estilo",
    "Settings" : "Defenições",
    "Compound Interest Calculator": "Calculadora de Juros Compostos",
    "Compound interest is a financial concept where interest is calculated not only on the initial amount (principal) but also on the accumulated interest from previous periods. In other words, compound interest generates interest on interest.": "Os juros compostos são um conceito financeiro em que os juros são calculados não apenas sobre o valor inicial (capital), mas também sobre os juros acumulados dos períodos anteriores. Em outras palavras, os juros compostos geram juros sobre juros.",
    "Learn more about Compound Interest >": "Saiba mais sobre Juros Compostos >",
    "Initial Investment": "Investimento Inicial",
    "Duration by years": "Duração em anos",
    "Additional Investment": "Investimento Adicional",
    "Interest Rate": "Taxa de Juro",
    "Compound Interest Frequency": "Frequência dos Juros Compostos",
    "Contribution Frequency": "Frequência das Contribuições",
    "Monthly": "Mensal",
    "Quarterly": "Trimestral",
    "Yearly": "Anual",
    "Calculator" : "Calculadora",
    "Expense fee rate (optional)" : "Taxa de despesa (opcional)",
    "Negotiation fee rate (optional)" : "Taxa de negociação (opcional)",
    "Calculate" : "Calcular",
    "Initial amount must be a positive number" : "Valor inicial deve ser um número positivo",
    "Annual interest rate must be a positive number" : "Taxa de juro anual deve ser um número positivo",
    "Years must be a positive number greater than 0" : "Anos devem ser um número positivo maior que 0",
    "Recurring contribution must be a positive number" : "A contribuição recorrente deve ser um número positivo",
    "Contribution frequency is required" : "A frequência de contribuição é obrigatória",
    "Capitalization frequency is required" : "A frequência de capitalização é obrigatória",
    "Result" : "Resultado",
    "Final amount": "Montante final",
    "Accumulated interest": "Juros acumulados",
    "Total invested": "Total investido",
    "Interst rate": "Taxa de juro",
    "Expense fee rate": "Taxa de despesas",
    "Negotiation fee rate": "Taxa de negociação",
    "Total fees paid": "Total de taxas pagas",
    "Make your simulation now and discover how your investment can grow over time! Calculate compound interest and explore different scenarios to see how small changes can significantly impact your financial goals. Understand the power of compound interest and find out how you can maximize your returns over the long term" : "Faça já a sua simulação e descubra como o seu investimento pode crescer ao longo do tempo! Calcule os juros compostos e explore diferentes cenários para ver como pequenas alterações podem ter um impacto significativo nos seus objetivos financeiros. Perceba o poder dos juros compostos e saiba como pode maximizar os seus rendimentos a longo prazo.",
    "Month" : "Mês",
    "Total paid on fees" : "Total pago em taxas",
    "Year" : "Ano",
    "Simulation" : "Simulação",
    "Monthly Table" : "Tabela mensal",
    "Yearly Table" : "Tabela anual",
    "Accumulated Interest Chart" : "Gráfico dos Juros Acumulados",
    "Detailed Compound Interest Table" : "Tabela detalhada de juros compostos",
    "Calculation successful" : "Cálculo bem sucedido"
  }
}
